<!-- 排水户 -->
<style lang="less">
.sewagelist {
  height: 100%;
  .ivu-tabs-content {
    height: calc(100% - 36px - 16px);
  }
  .Top {
    padding: 0.1rem;
    margin-bottom: 0.05rem;
    cursor: pointer;
  }

  .Title {
    color: #ffffff;
    font-size: 0.14rem;
    font-weight: bold;
    display: inline-block;
    vertical-align: middle;

    /**字符串太长 省略号 */
    width: 2rem;
    overflow: hidden;
    text-overflow: ellipsis;
    white-space: nowrap;
  }

  .midDiv {
    width: 100%;
    margin-top: 0.05rem;
    display: inline-block;

    .midlabel {
      font-size: 0.12rem;
      display: inline-block;
      color: rgba(255, 255, 255, 0.5);
      margin-right: 0.05rem;
    }

    .midvalue {
      font-size: 0.12rem;
      display: contents;
      color: #ffffff;
    }
  }
}
.pshModel {
  .ivu-form-item {
    width: 50%;
    display: inline-block;
    padding-left: 10px;
  }
  .formcol {
    .ivu-form-item-label {
      width: 50px !important;
    }
  }
  .ivu-form .ivu-form-item-label {
    text-align: left;
  }
}
.demo-spin-icon-load {
  color: #e22626;
  font-size: 0.12rem;
  animation: ani-demo-spin 1s linear infinite;
}
.demo-spin-text {
  font-size: 0.12rem;
  font-weight: bold;
  color: #e22626;
}
</style>
<template>
  <div class="sewagelist bgActive">
    <queryDialog v-if="isshow" :detailData="tableDialog"></queryDialog>

    <div style="padding: 0.1rem 0.15rem 0.1rem 0.1rem;">
      <Select clearable filterable placeholder="请输入所在街道" v-model="streetname" style="width: 1.1rem;">
        <Option :value="item" :key="item" v-for="(item,index) in streetList">{{item}}</Option>
      </Select>
      <Input clearablet v-model="curingunit" placeholder="请输入排水户名称" style="width: 1.1rem;margin-left: 0.05rem;" />
      <Button type="primary" @click="getData()" style="margin-left: 0.05rem;">查询</Button>
      <div style="margin-top: 10px;">
        <RadioGroup v-model="radioType" style="color: #fff;" @on-change="changetype">
          <Radio label="-1">全部</Radio>
          <Radio label="0">未过期</Radio>
          <Radio label="1">已过期</Radio>
        </RadioGroup>
      </div>
    </div>
    <div style="height: calc(100% - 1.25rem );overflow-y: auto;padding: 0 0.1rem;">
      <div :key="index" class="Top" v-for="(item,index) in list" :class="currentindex == item.objectid ? 'bgActiveT' : 'bgActiveF'" @click="listClick(item,index)">
        <div style="display: inline-block;position: relative;vertical-align: middle;text-align: center;">
          <div style="width: 0.30rem;height: 0.30rem;border-radius: 50%;background-color: #135e73;"></div>
          <div style="width: 0.23rem;height: 0.23rem;border-radius: 50%;background-color: rgb(0,152,152);position: absolute;top: 0.03rem;left: 0.03rem;">
          </div>
          <div style="text-align: center;width: 100%;line-height: 0.30rem;position: absolute;top: 0;left: 0;color: #fff;font-size: 0.12rem;">
            {{index+1}}
          </div>
        </div>
        <div class="Title" :title="item.排水许可名称">
          {{item.排水许可名称}}
        </div>
        <div style="float:right;font-weight: bold;" :style="{color:item.isexpired == 0 ? 'rgb(255, 255, 0)':'rgb(0, 255, 55)'}">
          {{item.是否到期}}
        </div>
        <div style="font-size: 0;margin-top: 0.1rem;">
          <Row>
            <Col :span="12">
            <div class="midDiv">
              <div class="midlabel">许可证编号:</div>
              <div class="midvalue">{{item.许可证编号}}</div>
            </div>
            </Col>
            <Col :span="12">
            <div class="midDiv">
              <div class="midlabel">排水户类型:</div>
              <div class="midvalue">{{item.排水户类型}}</div>
            </div>
            </Col>
            <Col :span="24">
            <div class="midDiv">
              <div class="midlabel">排水许可地址:</div>
              <div class="midvalue">{{item.排水许可地址}}</div>
            </div>
            </Col>
          </Row>
        </div>
      </div>
    </div>
    <div style="width: 100%;position: absolute; bottom: 0.05rem;text-align: center;">
      <span :show-total='true' style="color:#fff;font-size: 0.12rem;position: absolute;right: 0.2rem;">共{{page.total}}个</span>
      <Page simple :page-size="page.pageSize" :total="page.total" :current="page.currentPage" @on-change="changePage" ref="page"></Page>
    </div>
    <Spin v-if="isshowSpin" fix size="large"></Spin>
  </div>
</template>


<script>
import { MapControl } from "../../../arcgis_map/js/MapControl.js";
import bus from "../../../../eventBus.js";
import queryDialog from "../publics/queryDialog.vue"

export default {
  components: {
    queryDialog
  },
  data() {
    return {
      isshowSpin: false,

      currentindex: null,

      GeometryString: "",
      streetList: [
        "城管局",
        "红山街道",
        "环湖办",
        "梅园新村街道",
        "锁金村街道",
        "锁金街道",
        "孝陵卫街道",
        "新街口街道",
        "徐管委",
        "玄武湖街道",
        "玄武门街道"
      ],
      streetname: "",
      curingunit: "",
      radioType: '-1',

      tabledata: [],
      list: [],
      page: {
        pageSize: 10,
        currentPage: 1,
        total: 0
      },

      tableDialog: {},
      isshow: false,
      dialog: {
        show: false,
        title: {
          text: '排水户',
          className: 'xa-bg-blue'
        },
        bodyshow: true,
      },

    }
  },
  methods: {
    changetype(type) {
      this.radioType = type;
      this.getData();
    },
    getData() {
      if (MapControl.graphicLayers['gralyr3']) {
        MapControl.graphicLayers['gralyr3'].clear();
      }

      var _this = this;
      let datalist = [
        {
          "objectid": 23,
          "申请人": "何鲁华",
          "有效期开始时间": "2018-07-16 00:00:00",
          "有效期结束时间": "2023-07-15 00:00:00",
          "许可证编号": "20180421",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-07-16 00:00:00",
          "法定代表": "",
          "排水户类型": "2",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "环湖办",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0945.jpg",
          "排水许可名称": "白宫大酒店",
          "排水许可地址": "龙蟠路1号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.779443702 32.092751291)"
        },
        {
          "objectid": 16,
          "申请人": "种衍山",
          "有效期开始时间": "2018-07-12 00:00:00",
          "有效期结束时间": "2023-07-11 00:00:00",
          "许可证编号": "20180250",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-07-12 00:00:00",
          "法定代表": "",
          "排水户类型": "2",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "环湖办",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0732.jpg",
          "排水许可名称": "川杭饭店",
          "排水许可地址": "龙蟠路101号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.786757961 32.089978002)"
        },
        {
          "objectid": 200,
          "申请人": "吴其飞",
          "有效期开始时间": "2018-11-22 00:00:00",
          "有效期结束时间": "2023-11-21 00:00:00",
          "许可证编号": "20181435",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-11-22 00:00:00",
          "法定代表": "朱启宝",
          "排水户类型": "1",
          "营业执照注册号": "统一社会信用代码12320100E937940319",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw2476.jpg",
          "排水许可名称": "公教一村垃圾站",
          "排水许可地址": "北京东路41号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.794950681 32.061103661)"
        },
        {
          "objectid": 81,
          "申请人": "陈小齐",
          "有效期开始时间": "2018-06-29 00:00:00",
          "有效期结束时间": "2023-06-28 00:00:00",
          "许可证编号": "20180149",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-06-29 00:00:00",
          "法定代表": "陈小齐",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320000055159908F",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "徐管委",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0611.jpg",
          "排水许可名称": "江苏俺家小院文化发展有限公司",
          "排水许可地址": "徐庄软件基地行政服务中心辅楼",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.879381001 32.097990191)"
        },
        {
          "objectid": 156,
          "申请人": "潘国平",
          "有效期开始时间": "2018-09-30 00:00:00",
          "有效期结束时间": "2023-09-29 00:00:00",
          "许可证编号": "20181159",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-30 00:00:00",
          "法定代表": "潘国平",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320102571568986J",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "红山街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw2019.jpg",
          "排水许可名称": "江苏常发物业服务有限公司南京分公司（1号楼）",
          "排水许可地址": "红山路88号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.804741751 32.088231202)"
        },
        {
          "objectid": 162,
          "申请人": "潘国平",
          "有效期开始时间": "2018-09-30 00:00:00",
          "有效期结束时间": "2023-09-29 00:00:00",
          "许可证编号": "20181160",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-30 00:00:00",
          "法定代表": "潘国平",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320102571568986J",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "红山街道",
          "所在流域": "",
          "备注_照片": "未截图",
          "photo": "",
          "排水许可名称": "江苏常发物业服务有限公司南京分公司（2号楼）",
          "排水许可地址": "红山路88号2幢",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.804570811 32.088153621)"
        },
        {
          "objectid": 9,
          "申请人": "杜长城",
          "有效期开始时间": "2018-04-11 00:00:00",
          "有效期结束时间": "2023-04-10 00:00:00",
          "许可证编号": "20180023",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-04-11 00:00:00",
          "法定代表": "丁广龙",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码913200001347868897",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "环湖办",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0444.jpg",
          "排水许可名称": "江苏辰茂新世纪大酒店有限公司",
          "排水许可地址": "玄武区龙蟠路133号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.795127442 32.085402461)"
        },
        {
          "objectid": 71,
          "申请人": "王培",
          "有效期开始时间": "2017-12-29 00:00:00",
          "有效期结束时间": "2022-12-28 00:00:00",
          "许可证编号": "20170094",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-12-29 00:00:00",
          "法定代表": "",
          "排水户类型": "5",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "徐管委",
          "所在流域": "",
          "备注_照片": "未截图",
          "photo": "",
          "排水许可名称": "江苏福瑞生物医药有限公司",
          "排水许可地址": "玄武大道699-18号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.877484912 32.091887651)"
        },
        {
          "objectid": 102,
          "申请人": "赵帅涛",
          "有效期开始时间": "2018-02-08 00:00:00",
          "有效期结束时间": "2023-02-07 00:00:00",
          "许可证编号": "20180011",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-02-08 00:00:00",
          "法定代表": "梁杨兵",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320102MA1Q4WRJ9Y",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "新街口街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0430.jpg",
          "排水许可名称": "江苏海底捞餐饮管理有限责任公司南京第八分公司（新世界店）",
          "排水许可地址": "玄武区珠江路88号101（含2-5层及夹层）室",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.782566901 32.051240642)"
        },
        {
          "objectid": 75,
          "申请人": "王培",
          "有效期开始时间": "2017-12-29 00:00:00",
          "有效期结束时间": "2022-12-28 00:00:00",
          "许可证编号": "20170094",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-12-29 00:00:00",
          "法定代表": "",
          "排水户类型": "5",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "徐管委",
          "所在流域": "",
          "备注_照片": "未截图",
          "photo": "",
          "排水许可名称": "江苏诺迈博生物医药科技有限公司",
          "排水许可地址": "玄武大道699-18号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.882434102 32.090008071)"
        },
        {
          "objectid": 37,
          "申请人": "费金",
          "有效期开始时间": "2018-08-08 00:00:00",
          "有效期结束时间": "2023-08-07 00:00:00",
          "许可证编号": "20180604",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-08-08 00:00:00",
          "法定代表": "朱柏衡",
          "排水户类型": "1",
          "营业执照注册号": "统一社会信用代码913201047512512631",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "梅园新村街道",
          "所在流域": "",
          "备注_照片": "未截图",
          "photo": "",
          "排水许可名称": "江苏三盟物业管理有限公司（黄埔大厦）",
          "排水许可地址": "中山南路414号（黄埔路2号）",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.805721732 32.043527381)"
        },
        {
          "objectid": 54,
          "申请人": "赵凯",
          "有效期开始时间": "2017-04-17 00:00:00",
          "有效期结束时间": "2022-04-16 00:00:00",
          "许可证编号": "20170017",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-04-17 00:00:00",
          "法定代表": "",
          "排水户类型": "2",
          "营业执照注册号": "91320000741339386R",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "梅园新村街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0258.jpg",
          "排水许可名称": "江苏省会议中心有限公司",
          "排水许可地址": "",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.806448661 32.042512601)"
        },
        {
          "objectid": 205,
          "申请人": "王海涛",
          "有效期开始时间": "2018-09-30 00:00:00",
          "有效期结束时间": "2023-09-29 00:00:00",
          "许可证编号": "20181260",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-30 00:00:00",
          "法定代表": "王朝杰",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320100721763868H",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw2254.jpg",
          "排水许可名称": "江苏省军区第一招待所（南京高楼门饭店）",
          "排水许可地址": "高楼门62号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.781974701 32.065606682)"
        },
        {
          "objectid": 67,
          "申请人": "王晓明",
          "有效期开始时间": "2017-01-09 00:00:00",
          "有效期结束时间": "2022-01-08 00:00:00",
          "许可证编号": "20170002",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-01-09 00:00:00",
          "法定代表": "",
          "排水户类型": "1",
          "营业执照注册号": "91320000720584585F",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "徐管委",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0211.jpg",
          "排水许可名称": "江苏省软件产业股份有限公司",
          "排水许可地址": "玄武大道699-22号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.875234772 32.090321511)"
        },
        {
          "objectid": 211,
          "申请人": "高玉生",
          "有效期开始时间": "2018-10-25 00:00:00",
          "有效期结束时间": "2023-10-24 00:00:00",
          "许可证编号": "20181328",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-10-25 00:00:00",
          "法定代表": "谭颖",
          "排水户类型": "1",
          "营业执照注册号": "统一社会信用代码11320000014000204T",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw2329.jpg",
          "排水许可名称": "江苏省卫生和计划生育委员会",
          "排水许可地址": "中央路42号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.779314861 32.065193081)"
        },
        {
          "objectid": 201,
          "申请人": "肖玫",
          "有效期开始时间": "2018-05-15 00:00:00",
          "有效期结束时间": "2023-05-14 00:00:00",
          "许可证编号": "20180040",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-05-15 00:00:00",
          "法定代表": "冯继锋",
          "排水户类型": "5",
          "营业执照注册号": "统一社会信用代码12320000466002702G",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0461.jpg",
          "排水许可名称": "江苏省肿瘤医院",
          "排水许可地址": "百子亭42号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.780742371 32.070321601)"
        },
        {
          "objectid": 153,
          "申请人": "王秀丽",
          "有效期开始时间": "2018-09-12 00:00:00",
          "有效期结束时间": "2023-09-11 00:00:00",
          "许可证编号": "20181010",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-12 00:00:00",
          "法定代表": "魏爱春",
          "排水户类型": "4",
          "营业执照注册号": "320000000062907",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "红山街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw1829.jpg",
          "排水许可名称": "江苏天泓城星汽车装璜美容有限公司红山路店",
          "排水许可地址": "红山路184-3，184-4号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.803973861 32.095874701)"
        },
        {
          "objectid": 116,
          "申请人": "郭玉文",
          "有效期开始时间": "2018-10-25 00:00:00",
          "有效期结束时间": "2023-10-24 00:00:00",
          "许可证编号": "20181346",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-10-25 00:00:00",
          "法定代表": "翟杰",
          "排水户类型": "4",
          "营业执照注册号": "统一社会信用代码913200007344180865",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "红山街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw2347.jpg",
          "排水许可名称": "江苏天泓汽车维修有限公司",
          "排水许可地址": "十字街3号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.802716402 32.096657541)"
        },
        {
          "objectid": 214,
          "申请人": "常红卫",
          "有效期开始时间": "2018-09-20 00:00:00",
          "有效期结束时间": "2023-09-19 00:00:00",
          "许可证编号": "20181076",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-20 00:00:00",
          "法定代表": "范建华",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320102070726296L",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw1903.jpg",
          "排水许可名称": "江苏味洲美邻商业管理有限公司百子亭分公司",
          "排水许可地址": "中央路70号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.779225621 32.069539301)"
        },
        {
          "objectid": 69,
          "申请人": "王培",
          "有效期开始时间": "2017-12-29 00:00:00",
          "有效期结束时间": "2022-12-28 00:00:00",
          "许可证编号": "20170094",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-12-29 00:00:00",
          "法定代表": "",
          "排水户类型": "1",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "徐管委",
          "所在流域": "",
          "备注_照片": "未截图",
          "photo": "",
          "排水许可名称": "江苏先声药业有限公司（会议中心同心茶社）",
          "排水许可地址": "玄武大道699-18号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.880646551 32.091571642)"
        },
        {
          "objectid": 174,
          "申请人": "李俊",
          "有效期开始时间": "2018-06-27 00:00:00",
          "有效期结束时间": "2023-06-26 00:00:00",
          "许可证编号": "20180054",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-06-27 00:00:00",
          "法定代表": "金超",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码91320100MA1MUQDL8A",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "锁金村街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0476.jpg",
          "排水许可名称": "江苏新隆基置业有限公司南京金界酒店",
          "排水许可地址": "玄武区龙蟠路199号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.810526701 32.068422772)"
        },
        {
          "objectid": 196,
          "申请人": "詹晶晶",
          "有效期开始时间": "2017-07-20 00:00:00",
          "有效期结束时间": "2022-07-19 00:00:00",
          "许可证编号": "20170055",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-07-20 00:00:00",
          "法定代表": "",
          "排水户类型": "4",
          "营业执照注册号": "91320104MA1MG9BB05",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0359.jpg",
          "排水许可名称": "江苏新奇特网络科技有限公司（西家大塘文化创意产业园易自助洗车点）",
          "排水许可地址": "",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.783927212 32.066889832)"
        },
        {
          "objectid": 197,
          "申请人": "詹晶晶",
          "有效期开始时间": "2017-08-04 00:00:00",
          "有效期结束时间": "2022-08-03 00:00:00",
          "许可证编号": "20170062",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2017-08-04 00:00:00",
          "法定代表": "",
          "排水户类型": "4",
          "营业执照注册号": "91320104MA1MG9BB05",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武门街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0368.jpg",
          "排水许可名称": "江苏新奇特网络科技有限公司（垠坤创意中央科技文化园易自助洗车点）",
          "排水许可地址": "",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.780464791 32.088639481)"
        },
        {
          "objectid": 79,
          "申请人": "徐笑海",
          "有效期开始时间": "2018-06-27 00:00:00",
          "有效期结束时间": "2023-06-26 00:00:00",
          "许可证编号": "20180070",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-06-27 00:00:00",
          "法定代表": "楼晓君",
          "排水户类型": "1",
          "营业执照注册号": "统一社会信用代码91320000720583347Y",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "徐管委",
          "所在流域": "",
          "备注_照片": "未截图",
          "photo": "",
          "排水许可名称": "江苏银河物业管理有限公司（青创园）",
          "排水许可地址": "和燕路439号（湖景路9号）",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.885604741 32.092533091)"
        },
        {
          "objectid": 30,
          "申请人": "史志强",
          "有效期开始时间": "2018-09-20 00:00:00",
          "有效期结束时间": "2023-09-19 00:00:00",
          "许可证编号": "20181088",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-20 00:00:00",
          "法定代表": "",
          "排水户类型": "2",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "环湖办",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw1916.jpg",
          "排水许可名称": "金陵大排档",
          "排水许可地址": "龙蟠路107号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.788325032 32.089335851)"
        },
        {
          "objectid": 1,
          "申请人": "钱惠海",
          "有效期开始时间": "2018-07-30 00:00:00",
          "有效期结束时间": "2023-07-29 00:00:00",
          "许可证编号": "20180575",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-07-30 00:00:00",
          "法定代表": "李正才",
          "排水户类型": "3",
          "营业执照注册号": "统一社会信用代码913201024258401602",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "城管局",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw1150.jpg",
          "排水许可名称": "聚宝山庄垃圾转运站",
          "排水许可地址": "聚宝山庄小区内",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.855623592 32.100057622)"
        },
        {
          "objectid": 221,
          "申请人": "管晨睿",
          "有效期开始时间": "2018-06-27 00:00:00",
          "有效期结束时间": "2023-06-26 00:00:00",
          "许可证编号": "20180072",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-06-27 00:00:00",
          "法定代表": "",
          "排水户类型": "2",
          "营业执照注册号": "",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "环湖办",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0504.jpg",
          "排水许可名称": "肯德基南京站",
          "排水许可地址": "龙蟠路111号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.790012451 32.088605892)"
        },
        {
          "objectid": 88,
          "申请人": "程宝真",
          "有效期开始时间": "2018-09-12 00:00:00",
          "有效期结束时间": "2023-09-11 00:00:00",
          "许可证编号": "20180970",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-09-12 00:00:00",
          "法定代表": "程宝真",
          "排水户类型": "4",
          "营业执照注册号": "统一社会信用代码91320102580474260A",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "孝陵卫街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw1780.jpg",
          "排水许可名称": "南京爱拓普汽车服务有限公司",
          "排水许可地址": "东苑路70号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.838804822 32.026132721)"
        },
        {
          "objectid": 227,
          "申请人": "谢欣春",
          "有效期开始时间": "2018-11-22 00:00:00",
          "有效期结束时间": "2023-11-21 00:00:00",
          "许可证编号": "20181464",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-11-22 00:00:00",
          "法定代表": "谢欣春",
          "排水户类型": "4",
          "营业执照注册号": "统一社会信用代码91320102762103022T",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "玄武湖街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw2505.jpg",
          "排水许可名称": "南京安飞汽车服务有限公司",
          "排水许可地址": "蒋王庙124号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.824218541 32.080239102)"
        },
        {
          "objectid": 160,
          "申请人": "兰乾付",
          "有效期开始时间": "2018-02-02 00:00:00",
          "有效期结束时间": "2023-02-01 00:00:00",
          "许可证编号": "20180010",
          "许可证编号字": "苏玄排证字",
          "发证日期": "2018-02-02 00:00:00",
          "法定代表": "兰乾付",
          "排水户类型": "2",
          "营业执照注册号": "统一社会信用代码92320102MA1NFQBK67",
          "排污重点名录": "是",
          "证书类型": "正式排水",
          "所在街道": "锁金村街道",
          "所在流域": "",
          "备注_照片": "已截图",
          "photo": "xw0429.jpg",
          "排水许可名称": "南京八娃小吃部",
          "排水许可地址": "南京市玄武区锁金五村16号",
          "所属区划": "玄武区",




          "isexpired": 0,
          "geo": "POINT(118.811590461 32.076233851)"
        }
      ]

      _this.page.total = datalist.length;
      let source = datalist;
      for (let i = 0; i < source.length; i++) {
        debugger
        source[i].是否到期 = source[i].isexpired == 0 ? '未过期' : '已过期';
        let wkt = MapControl.WktToAgs(source[i].geo);
        var obj = {
          geometry: wkt,
          symbol: {
            type: 'PictureMarkerSymbol', //SimpleMarkerSymbol 或者 PictureMarkerSymbol
            image: '排水户.png', //图片名称，带文件后缀(类型为PictureMarkerSymbol)
            height: 45,
            width: 26
          },
          isClear: false, //是否清除当前地图元素
          attributes: source[i], //元素属性(可选)
          setOffset: {
            x: 0,
            y: 20
          },
          layer: "gralyr3"
        };
        MapControl.addGraphic(obj);
      }
      _this.tabledata = source;

      this.changePage(1);
      var gralyr3 = MapControl.graphicLayers['gralyr3']
      gralyr3.onClick = function (val) {
        let value = val.graphic.attributes;

        _this.currentindex = value.objectid;
        _this.isshow = true;
        _this.tableDialog = { list: value, title: value.排水许可名称 };

        let gralyrList = gralyr3.graphics;
        for (let k = 0; k < gralyrList.length; k++) {
          gralyrList[k].symbol.url = 'assets/img/map/排水户2.png';
        }
        val.graphic.symbol.url = 'assets/img/map/排水户1.png';
        gralyr3.redraw();
      }
    },
    //  前端分页
    changePage(current) {
      let pagesize = 10 //每页显示条数
      let startIndex = (current - 1) * pagesize
      var list = []
      let result = this.tabledata
      var num = 0
      if (result.length < startIndex + pagesize) {
        num = result.length
      } else {
        num = startIndex + pagesize
      }
      for (let j = startIndex; j < num; j++) {
        list.push(result[j])
      }
      this.list = list
    },
    listClick(item, index) {
      this.currentindex = item.objectid;

      let wkt = MapControl.WktToAgs(item.geo);
      MapControl.showExtent(wkt, 0);

      var gralyr3 = MapControl.graphicLayers['gralyr3']
      let gralyrList = gralyr3.graphics;
      for (let k = 0; k < gralyrList.length; k++) {
        let attr = gralyrList[k].attributes;
        if (attr.objectid == item.objectid)
          gralyrList[k].symbol.url = 'static/img/map/排水户1.png';
        else
          gralyrList[k].symbol.url = 'static/img/map/排水户2.png';
      }
      gralyr3.redraw();

      this.isshow = true;
      this.tableDialog = { list: item, title: item.排水许可名称 };
    },
  },
  mounted() {
    var _this = this;
    _this.getData();
  },
  beforeDestroy() {
    var gralyr3 = MapControl.graphicLayers['gralyr3']
    if (gralyr3) {
      gralyr3.clear();
      gralyr3.onClick = function (val) { };
    }
  },
  created() {
  },
}
</script>
